In [1]:
minus = lambda x,y:x-y
minus(9,7)

2

In [2]:
import pandas as pd
dict1={
    "name":['hrithik','bhoumik','satwik'],
    "marks":[95,93,91],
    "city":['Uchede','Pen','Pen']
}
df=pd.DataFrame(dict1)
df

      name  marks    city
0  hrithik     95  Uchede
1  bhoumik     93     Pen
2   satwik     91     Pen

In [3]:
df["marks"]

0    95
1    93
2    91
Name: marks, dtype: int64

In [4]:
df["marks"][1]=50

C:\Users\hrith\AppData\Local\Temp\ipykernel_3764\3989734226.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["marks"][1]=50

In [5]:
df

      name  marks    city
0  hrithik     95  Uchede
1  bhoumik     50     Pen
2   satwik     91     Pen

In [6]:
df.index=['01','02','03']

In [7]:
df

       name  marks    city
01  hrithik     95  Uchede
02  bhoumik     50     Pen
03   satwik     91     Pen

In [8]:
import numpy as np

In [9]:
a=np.random.rand(345,5)

In [10]:
df2=pd.DataFrame(a)

In [11]:
df2

            0         1         2         3         4
0    0.152928  0.075460  0.779739  0.122148  0.519781
1    0.473965  0.730235  0.737311  0.445809  0.415074
2    0.948494  0.246915  0.116379  0.176808  0.954565
3    0.114940  0.765818  0.445423  0.528839  0.257504
4    0.735533  0.724959  0.441941  0.369335  0.483641
..        ...       ...       ...       ...       ...
340  0.781359  0.248296  0.531580  0.620474  0.600099
341  0.921250  0.462677  0.317861  0.234250  0.538482
342  0.153761  0.415751  0.724977  0.617011  0.634762
343  0.091237  0.800894  0.148207  0.175798  0.641485
344  0.641181  0.302790  0.154358  0.368208  0.621664

[345 rows x 5 columns]

In [12]:
f=open("DemoProgram.txt","a")

f.write("\n")
f.write("Hrithik")
f.close

In [13]:
a=5
print("hi "+str(5))

hi 5